# Pandas

Pandas is one of the most popular python libraries used in data science. It offers high-performance, user-friendly structures and data analysis tools. Unlike the NumPy library, which has objects for multidimensional arrays, Pandas has aÂ 2d table object named Dataframe. It's similar to a spreadsheet, but with column names and row labels.

**So why do we need Pandas?**
* Accessing data from a dataframe with column and row names is much more easier than accessing data in Numpy
* Numpy array accepts only homogeneous data, pandas dataframe accepts different data types (float, int, string, datetime, etc) all in one dataframe
* Pandas offeres a vide range of built in functions like easy joins, rolling windows
* 2D dataframes (similar to spreadsheets) are easier to code and interpret than multi-dimentional arrays

In Pandas data frame indexing starts from 0


Prerequisites -
Python - If you don't already have Python, I strongly advise you to install the Anaconda Distribution (includes Python, NumPy, and many other commonly used packages)

Numpy - NumPy may be installed with conda or pip. I recommend pip because it is simple and straightforward.

                   "pip install numpy"
                   
Pandas - Pandas may be installed with conda or pip. I recommend pip because it is simple and straightforward.
                   
                   "pip install pandas"

In [2]:
import numpy as np
import pandas as pd
pd

### Read data
**From CSV** <br> 
Outputs a data frame <br>
pd.read_csv(...., index_col = <-->) <br>
pd.read_excel(...., index_col = <-->)<br>

or you can set index after reading using
df.set_index(<..a list of series...>)

To convert a dict to df <br>
**pd.DataFrame(dict)**

Lets start with a basic data frame, pandas assigns index by default, if not provided

In [197]:
#From dictonary 
#index by default
dict = {"Country" : ["India", "China", "Russia"], "Capital":["Delhi","Beijing","Moscow"]}
print(pd.DataFrame(dict))

print("---------------")
#from a list of dictionaries
dict = [{"Country" : "India", "Capital":"Delhi"}, 
        {"Country" : "China", "Capital": "Beijing"}, 
        { "Country" : "Russia", "Capital":"Moscow"}]
print(pd.DataFrame(dict))


print("---------------")
#lets pass indices
df = pd.DataFrame(dict)
df.index = ["C1","C2","C3"]
print(df)

print("---------------")

df = pd.DataFrame(dict, index=["C1","C2","C3"])
print(df)

print("---------------")
#from nd array
data = [["India","Delhi"],["China","Beijing"], ["Russia","Moscow"]]
clnames = ["country", "capital"]
print(pd.DataFrame(data, columns = clnames))

  Country  Capital
0   India    Delhi
1   China  Beijing
2  Russia   Moscow
---------------
  Country  Capital
0   India    Delhi
1   China  Beijing
2  Russia   Moscow
---------------
   Country  Capital
C1   India    Delhi
C2   China  Beijing
C3  Russia   Moscow
---------------
   Country  Capital
C1   India    Delhi
C2   China  Beijing
C3  Russia   Moscow
---------------
  country  capital
0   India    Delhi
1   China  Beijing
2  Russia   Moscow

Indices may not be unique, may not be an integer

In [23]:
df = pd.DataFrame(dict, index=["C1","C1","C3"])
print(df)
df = pd.DataFrame(dict, index=[1.1,1.2,3.4])
print(df)

   Country  Capital
C1   India    Delhi
C1   China  Beijing
C3  Russia   Moscow
    Country  Capital
1.1   India    Delhi
1.2   China  Beijing
3.4  Russia   Moscow

### Access data

Lets see how to access data, rolling back to previous data frame

In [56]:
df_access = pd.DataFrame(dict)
# We cant use this df as a R data frame, below will throw an error
df_access[1]

KeyError: 1

In [100]:
#To access data use any of the below, [m:n] - n excluded
#outputs a pandas dataframe
print(df_access[0:3])
print(type(df_access[0:3]))
print("---------------")
#outputs a pandas series
print(df_access['Country'])
print(type(df_access['Country']))

#To get a data frame out of this
print(df_access[['Country']])
print(type(df_access[['Country']]))


print("---------------")
#outputs a pandas series
print(df_access[1:2]['Country'])
print("---------------")
#outputs a pandas dataframe
print(df_access.head(2))
print(df_access.tail(2))

  Country  Capital
0   India    Delhi
1   China  Beijing
2  Russia   Moscow
<class 'pandas.core.frame.DataFrame'>
---------------
0     India
1     China
2    Russia
Name: Country, dtype: object
<class 'pandas.core.series.Series'>
  Country
0   India
1   China
2  Russia
<class 'pandas.core.frame.DataFrame'>
---------------
1    China
Name: Country, dtype: object
---------------
  Country  Capital
0   India    Delhi
1   China  Beijing
  Country  Capital
1   China  Beijing
2  Russia   Moscow

### Shape
(rows , columns)

In [88]:
df.shape

(3, 2)

### Access a column

In [89]:
df.Country

C1     India
C2     China
C3    Russia
Name: Country, dtype: object

### Index based selection 
If we want to select a partition of databased on index <br>
(m:n)  - n excluded

In [99]:
print("lets access row 0") 
print(df.iloc[0])
print("------------")
print("lets access row 0 and col 1")
print(df.iloc[0,1])
print("------------")
print("Col 0")
print(df.iloc[:,0])
print("------------")
print("Some slice")
print(df.iloc[1:3,0])
print("------------")
print("based on a list")
print(df.iloc[[0,2],0])

lets access row 0
Country    India
Capital    Delhi
Name: C1, dtype: object
------------
lets access row 0 and col 1
Delhi
------------
Col 0
C1     India
C2     China
C3    Russia
Name: Country, dtype: object
------------
Some slice
C2     China
C3    Russia
Name: Country, dtype: object
------------
based on a list
C1     India
C3    Russia
Name: Country, dtype: object

### Label based selection
(m,n) - n included <br>
why? <br>
this is label based searching, if someone wants to get all countries from China to India, its easy to give China:India,
rather than finding out what comes after india and then give China:Indonesia

In [106]:
df_access.loc[0:1,'Country']

0    India
1    China
Name: Country, dtype: object

In [105]:
df.loc['C2','Country']

'China'

### Conditional Selection

In [107]:
df.loc[df.Country == 'India']
# all logical comparision operators can be used >,< , & | ...

   Country Capital
C1   India   Delhi

### Summary

In [133]:
dict = {"Country" : ["India", "China", "Russia"], "Capital":["Delhi","Beijing","Moscow"]}
df_summ = (pd.DataFrame(dict))
#lets create a new col
df_summ['new_col'] = pd.Series([1,2,3]).astype(int)

print("data tyoes of columns")
print(df_summ.dtypes)

print("Summary")
#for numeric
print(df_summ.new_col.describe())
#for cat 
print(df_summ.Country.describe())

data tyoes of columns
Country    object
Capital    object
new_col     int64
dtype: object
Summary
count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: new_col, dtype: float64
count          3
unique         3
top       Russia
freq           1
Name: Country, dtype: object

Other functions include <br>
* mean() <br>
* unique() <br>
* value_counts() - unique values and their frequency <br>
* df.describe().round(2) 
* df.nunique()

### Map
To transform data

In [134]:
df_summ.new_col.map(lambda p: p - (df_summ.new_col.mean()))

0   -1.0
1    0.0
2    1.0
Name: new_col, dtype: float64

### Apply
To transform the whole data frame with custome methods for each row <br>
axis = 'columns' -> should pass a function to transform each row <br>
axis = 'index' -> should pass a function to transform each column <br>

In [155]:
def mean_apply(data_frame) :
    data_frame.new_col = data_frame.new_col *2
    return data_frame
df_summ.apply(mean_apply, axis = 'columns')

  Country  Capital  new_col
0   India    Delhi        2
1   China  Beijing        4
2  Russia   Moscow        6

In [144]:
#Above shown are just simple examples, Map and Apply are generally used for complex transorms, above subtraction can ve acheived by just doing
df_summ.new_col - df_summ.new_col.mean()

0   -1.0
1    0.0
2    1.0
Name: new_col, dtype: float64

### Grouping and Sorting

In [168]:
df_group = df_summ.copy()
#append a new row
df_group.loc[3] = ["India", "Delhi",10]

#lets group by country 
print(df_group.groupby('Country').Country.count())
#nothing but
print(df_group.Country.value_counts())

Country
China     1
India     2
Russia    1
Name: Country, dtype: int64
India     2
Russia    1
China     1
Name: Country, dtype: int64

In [169]:
df_group.groupby('Country').new_col.min()

Country
China     2
India     1
Russia    3
Name: new_col, dtype: int64

In [181]:
#Grouping gives out values in index order not value order, so we need to sort
#Sorting 
df_group.sort_values(by = "new_col", ascending= False)

  Country  Capital  new_col
3   India    Delhi       10
2  Russia   Moscow        3
1   China  Beijing        2
0   India    Delhi        1

In [183]:
df_group.sort_index()

  Country  Capital  new_col
0   India    Delhi        1
1   China  Beijing        2
2  Russia   Moscow        3
3   India    Delhi       10

In [185]:
df_group.sort_values(by = ['Country','new_col'], ascending= False)

  Country  Capital  new_col
2  Russia   Moscow        3
3   India    Delhi       10
0   India    Delhi        1
1   China  Beijing        2

### Misc

In [199]:
# To change data type 
# df.new_col.astype('float64')

In [212]:
# IS null
df = pd.DataFrame({"Country" : ["India", "China", "Russia"], "Capital":["Delhi","Beijing","Moscow"]})
df.iloc[2] = [np.nan, np.nan]
df.isnull().sum()

Country    1
Capital    1
dtype: int64

In [214]:
#fill na
df.fillna("hi")

  Country  Capital
0   India    Delhi
1   China  Beijing
2     NaN      NaN

In [215]:
df.notnull()

   Country  Capital
0     True     True
1     True     True
2    False    False

In [217]:
df.isnull()

   Country  Capital
0    False    False
1    False    False
2     True     True

In [218]:
df.dropna()

  Country  Capital
0   India    Delhi
1   China  Beijing

### Pandas Series
Series is just a sequence of data, data frame is a set of series

In [87]:
temp = pd.Series([1,2,3,4,5])
print(temp)
temp[0]

0    1
1    2
2    3
3    4
4    5
dtype: int64

1

### String operators

In [189]:
df['Country'].str.lower()

0     india
1     china
2    russia
Name: Country, dtype: object

In [191]:
df['Capital'].str.replace("e","_")

0      D_lhi
1    B_ijing
2     Moscow
Name: Capital, dtype: object

### Renaming and Combining

In [220]:
df_group.rename(columns = {'new_col':"temp"})

  Country  Capital  temp
0   India    Delhi     1
1   China  Beijing     2
2  Russia   Moscow     3
3   India    Delhi    10

#### combining 
* .concat() - to concat 2 data sets with same columns - merged via rows
* .join() - similar to sql join
* .merge()